package ru.growapp.tftelegram.dic;

import java.util.Arrays;
import java.util.List;

public class Constants {
    private String[] instructors = new String[] {
            "Авдеева Екатерина",
            "Меняйлова Алина",
            "Фирсова Екатерина",
            "Зинченко Александра",
            "Задорожная Дарья",
            "Худеньких Инна",
            "Погодин Максим",
            "Швец Павел",
            "Слободчикова Елена",
            "Довлядова Юлия",
            "Баранова Виктория",
            "Малышев Илья",
            "Маммадли Кенан",
            "Джабиев Асиф",
            "Дзангиев Ислам"
    };

    private String[] workouts = new String[] {
            "Растяжка и шпагат",
            "ТРХ",
            "Гамаки",
            "Пилон",
            "Пилатес на тренажёре реформер",
            "Пилатес с оборудованием",
            "Осанка и походка",
            "Здоровая спина",
            "Йога для беременных",
            "МФР",
            "Силовые тренировки",
            "Похудение (+коррекция питания)",
            "Функциональные тренировки",
            "Постановка танца",
            "Стрип пластика",
            "Латина",
            "Зумба",
            "Восстановление после травм",
            "Ягодицы 3D",
            "Йога и йоготерапия",
            "Бокс",
            "Грэпплинг",
            "ММА",
            "Кикбоксинг",
            "Сплит - тренировки (вдвоем)",
            "Тренировки в тренажерном зале",
            "Индивидуальный запрос",
            "Bosu",
            "HiiT - интервальная тренировка"
    };

    public List<String> getInstructors() {
        return Arrays.stream(instructors).sorted().toList();
    }

    public List<String> getWorkouts() {
        return Arrays.stream(workouts).sorted().toList();
    }
}
